app/controllers/api/v1/identies_controller.rb

SELECT "identies".* FROM "identies"
---
  def index
      @identies = Identy.all

SELECT "identies".* FROM "identies" WHERE "identies"."id" = ? LIMIT ?  [["id", 84], ["LIMIT", 1]]
---
    def set_identy
      if Identy.where(id: params[:id]).count == 0
          render json: {code: 200, success: false, messages: "data tidak ditemukan"}
      else
        @identy = Identy.find(params[:id])