app/controllers/api/v1/pre_test_controller.rb

SELECT "references".* FROM "references" WHERE "references"."jenis" = ? ORDER BY "references"."id" DESC LIMIT ?  [["jenis", 2], ["LIMIT", 1]]
SELECT "skor_efikasis".* FROM "skor_efikasis" WHERE "skor_efikasis"."referensi_soal" = ? AND "skor_efikasis"."pre_test_id" = ? LIMIT ?  [["referensi_soal", 21], ["pre_test_id", 28], ["LIMIT", 1]]
SELECT 1 AS one FROM "skor_efikasis" WHERE "skor_efikasis"."referensi_soal" = ? AND "skor_efikasis"."id" != ? AND "skor_efikasis"."pre_test_id" = ? LIMIT ?  [["referensi_soal", 21], ["id", 91], ["pre_test_id", 28], ["LIMIT", 1]]
SELECT "skor_efikasis".* FROM "skor_efikasis" WHERE (skor_efikasis.pre_test_id = 22 AND skor_efikasis.referensi_soal = 26)
UPDATE "skor_efikasis" SET "jawaban" = ?, "updated_at" = ? WHERE "skor_efikasis"."id" = ?  [["jawaban", 80], ["updated_at", "2022-11-08 23:17:33.784268"], ["id", 91]]
SELECT AVG("skor_efikasis"."jawaban") FROM "skor_efikasis" WHERE (skor_efikasis.pre_test_id = 22)
SELECT 1 AS one FROM "skor_efikasis" WHERE "skor_efikasis"."referensi_soal" = ? AND "skor_efikasis"."pre_test_id" = ? LIMIT ?  [["referensi_soal", 21], ["pre_test_id", 28], ["LIMIT", 1]]
INSERT INTO "skor_efikasis" ("referensi_soal", "jawaban", "pre_test_id", "post_test_id", "jenis", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["referensi_soal", 21], ["jawaban", 90], ["pre_test_id", 28], ["post_test_id", nil], ["jenis", 1], ["created_at", "2022-11-08 23:17:26.269607"], ["updated_at", "2022-11-08 23:17:26.269607"]]
---
    def effication_pre_test

        # jika belum ada pre test
        if cek_pre_test.present?

            # @respon = "pre test telah dilakukan"

            @skor_efikasis = SkorEfikasi.new(test_params)
            @skor_efikasis.pre_test_id = cek_pre_test.id
            @skor_efikasis.jenis = 1

            @soal = Reference.where(jenis: 2)

            @cek_efikasi_selesai = SkorEfikasi.where("skor_efikasis.pre_test_id = #{cek_pre_test.id} AND skor_efikasis.referensi_soal = #{@soal.last.id}")

            if @cek_efikasi_selesai.present?

                @hitung_efikasi = SkorEfikasi.where("skor_efikasis.pre_test_id = #{cek_pre_test.id}")

                cek_pre_test.update(total_skor_efikasi: @hitung_efikasi.average(:jawaban).to_f.round)

                @respon = "Pre Test skor efikasi berhasil diupdate. #{cek_pre_test}"

            else
                # validasi soal
                @cek_pre_test_efikasi = SkorEfikasi.find_by(referensi_soal: @skor_efikasis.referensi_soal, pre_test_id: @skor_efikasis.pre_test_id)

                if Resources::ReferensiSoal.efikasi_by(params[:referensi_soal]).present?
                    if @skor_efikasis.save
                        @respon = "soal no. #{@skor_efikasis.referensi_soal} berhasil disimpan"
                        @status = 200
                    elsif @cek_pre_test_efikasi.present?
                        @respon = @cek_pre_test_efikasi.update(jawaban: @skor_efikasis.jawaban)

SELECT "references".* FROM "references" WHERE "references"."jenis" = ?  [["jenis", 3]]
SELECT "level_traumas".* FROM "level_traumas" WHERE (level_traumas.pre_test_id = 22 AND level_traumas.referensi_soal = 48)
SELECT 1 AS one FROM "level_traumas" WHERE "level_traumas"."referensi_soal" = ? AND "level_traumas"."id" != ? AND "level_traumas"."pre_test_id" = ? LIMIT ?  [["referensi_soal", 27], ["id", 88], ["pre_test_id", 28], ["LIMIT", 1]]
SELECT "level_traumas".* FROM "level_traumas" WHERE (level_traumas.pre_test_id = 28 AND level_traumas.referensi_soal = 48)
SELECT AVG("level_traumas"."jawaban") FROM "level_traumas" WHERE (level_traumas.pre_test_id = 22)
SELECT "level_traumas".* FROM "level_traumas" WHERE "level_traumas"."referensi_soal" = ? AND "level_traumas"."pre_test_id" = ? LIMIT ?  [["referensi_soal", 27], ["pre_test_id", 28], ["LIMIT", 1]]
SELECT 1 AS one FROM "level_traumas" WHERE "level_traumas"."referensi_soal" = ? AND "level_traumas"."pre_test_id" = ? LIMIT ?  [["referensi_soal", 27], ["pre_test_id", 28], ["LIMIT", 1]]
INSERT INTO "level_traumas" ("referensi_soal", "jawaban", "pre_test_id", "post_test_id", "jenis", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["referensi_soal", 27], ["jawaban", 80], ["pre_test_id", 28], ["post_test_id", nil], ["jenis", 1], ["created_at", "2022-11-08 23:12:21.244206"], ["updated_at", "2022-11-08 23:12:21.244206"]]
---
    def level_trauma_pre_test

        # jika belum ada pre test
        if cek_pre_test.present?

            @respon = "pre test telah dilakukan"

            @level_trauma = LevelTrauma.new(test_params)
            @level_trauma.pre_test_id = cek_pre_test.id
            @level_trauma.jenis = 1

            @soal = Reference.where(jenis: 3)
            cek_soal = @soal.select  { |v| v.id == 1 }

            @cek_level_trauma_selesai = LevelTrauma.where("level_traumas.pre_test_id = #{cek_pre_test.id} AND level_traumas.referensi_soal = #{@soal.last.id}")

            # if cek_soal.present?
                if @cek_level_trauma_selesai.present?

                    @hitung = LevelTrauma.where("level_traumas.pre_test_id = #{cek_pre_test.id}")

                    cek_pre_test.update(total_level_trauma_id: @hitung.average(:jawaban).to_f.round)

                    @respon = "Pre Test level trauma berhasil diupdate"
                    @status = 200

                else
                    @cek_pre_test_level_trauma = LevelTrauma.find_by(referensi_soal: @level_trauma.referensi_soal, pre_test_id: @level_trauma.pre_test_id)

                    # cek soal
                    if Resources::ReferensiSoal.level_trauma_by(params[:referensi_soal]).present?
                        if @level_trauma.save

SELECT "pre_tests".* FROM "pre_tests" WHERE "pre_tests"."periode_treatment_id" = ? LIMIT ?  [["periode_treatment_id", 1], ["LIMIT", 1]]
---
    def skor
        skor = PreTest.find_by(periode_treatment_id: params[:periode_treatment_id])

        if skor.present?

SELECT "pre_tests".* FROM "pre_tests" WHERE "pre_tests"."periode_treatment_id" = ? LIMIT ?  [["periode_treatment_id", 1024], ["LIMIT", 1]]
---
        def cek_pre_test
          cek_pre_test = PreTest.find_by(periode_treatment_id: params[:periode_treatment_id])

SELECT "periode_treatments".* FROM "periode_treatments" WHERE "periode_treatments"."id" = ? LIMIT ?  [["id", 1024], ["LIMIT", 1]]
---
        def cek_periode_treatment
            @periode_treatment_id = PeriodeTreatment.find_by(id: params[:periode_treatment_id])