app/controllers/api/v1/references_controller.rb

SELECT "references".* FROM "references" WHERE "references"."jenis" = ?  [["jenis", 1]]
---
  def hobby
    @hobi = Reference.where(jenis: 1)

SELECT "references".* FROM "references" WHERE "references"."jenis" = ?  [["jenis", 2]]
SELECT "references".* FROM "references" WHERE "references"."jenis" = ?  [["jenis", 3]]
---
  def link_medsos


    if params[:hobi].present?
      @link_medsos = Reference.where(jenis: 14, ref_code: params[:hobi])
    else
      @link_medsos = Reference.where(jenis: 14)
    end

    @data = []

    @link_medsos.each do |medsos|

SELECT "references".* FROM "references" WHERE "references"."jenis" = ?  [["jenis", 2]]
---
  def effication_test
    @effication_test = Reference.where(jenis: 2)

SELECT "references".* FROM "references" WHERE "references"."jenis" = ?  [["jenis", 3]]
---
  def level_trauma
    @effication_test = Reference.where(jenis: 3)