app/controllers/api/v1/treatment_controller.rb

INSERT INTO "periode_treatments" ("identitas_id", "status", "tanggal_awal", "tanggal_akhir", "created_at", "updated_at", "inferensi") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "pre_tests" ("total_skor_efikasi", "total_level_trauma_id", "periode_treatment_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["total_skor_efikasi", nil], ["total_level_trauma_id", nil], ["periode_treatment_id", 1024], ["created_at", "2022-11-08 23:11:38.004176"], ["updated_at", "2022-11-08 23:11:38.004176"]]
---
    def periode

        @periode = PeriodeTreatment.new(periode_params)
        @periode.tanggal_akhir = "0000-00-00"

        if @cek.present?

            render :json => {"code": 400, success: false, "messages": "Anda memiliki treatment yang belum selesai.", data: nil}, status: 400

        else
            if @periode.save
                Test.create!(periode_treatment_id: @periode.id)

SELECT "periode_treatments".* FROM "periode_treatments" WHERE "periode_treatments"."identitas_id" = ?  [["identitas_id", 60]]
---
    def show_periode

        @periode = PeriodeTreatment.where(identitas_id: params[:identitas_id])

        if params[:identitas_id].present? && @periode.present?

INSERT INTO "treatments" ("treat", "check", "periode_treatment_id", "created_at", "updated_at", "tanggal") VALUES (?, ?, ?, ?, ?, ?)  [["treat", 103], ["check", nil], ["periode_treatment_id", 1018], ["created_at", "2022-10-06 11:33:24.381795"], ["updated_at", "2022-10-06 11:33:24.381795"], ["tanggal", "2022-10-06"]]
---
    def generate
        Resources::Tools.create_treatment_by(params[:periode_treatment_id])

SELECT "treatments".* FROM "treatments" WHERE "treatments"."periode_treatment_id" = ? AND "treatments"."tanggal" = ?  [["periode_treatment_id", 1017], ["tanggal", "2022-10-06"]]
SELECT "treatments".* FROM "treatments" WHERE "treatments"."periode_treatment_id" = ? AND "treatments"."tanggal" = ?  [["periode_treatment_id", 1017], ["tanggal", "2022-10-16"]]
---
    def by_date

       @treatment = Treatment.where(periode_treatment_id: params[:periode_treatment], tanggal: Date.today)

       if @treatment.present?

SELECT "treatments".* FROM "treatments" WHERE "treatments"."id" = ? AND "treatments"."periode_treatment_id" = ? AND "treatments"."tanggal" = ? LIMIT ?  [["id", 102], ["periode_treatment_id", 1017], ["tanggal", "2022-10-06"], ["LIMIT", 1]]
UPDATE "treatments" SET "treat" = ?, "updated_at" = ? WHERE "treatments"."id" = ?  [["treat", 1], ["updated_at", "2022-10-06 11:25:52.591943"], ["id", 102]]
---
    def update_treat

        @treat = Treatment.find_by(id: params[:id], periode_treatment_id: params[:periode_treatment], tanggal: Date.today)

        if @treat.present?

         if @treat.check == true

            @treat.update(check: 0)

SELECT "periode_treatments".* FROM "periode_treatments" WHERE "periode_treatments"."identitas_id" = ? AND "periode_treatments"."tanggal_akhir" IS NULL LIMIT ?  [["identitas_id", 89], ["LIMIT", 1]]
---
        def cek_periode_treatment_selesai
            @cek = PeriodeTreatment.find_by(identitas_id: params[:identitas_id], tanggal_akhir: nil)