app/controllers/users_controller.rb

SELECT "identies".* FROM "identies" WHERE "identies"."no_hp" = ? AND "identies"."tanggal_lahir" = ? LIMIT ?  [["no_hp", "082199251178"], ["tanggal_lahir", "1997-11-22"], ["LIMIT", 1]]
SELECT "history_tokens".* FROM "history_tokens" WHERE "history_tokens"."user" = ? LIMIT ?  [["user", 85], ["LIMIT", 1]]
UPDATE "history_tokens" SET "token" = ?, "updated_at" = ? WHERE "history_tokens"."id" = ?  [["token", "[FILTERED]"], ["updated_at", "2022-10-06 10:43:42.830495"], ["id", 4]]
---
    def login

      @user = Identy.find_by(no_hp: params[:no_hp], tanggal_lahir: params[:tanggal_lahir])

      if @user
        token = encode_token({identy_id: @user.id})

        historytoken = HistoryToken.find_by(user: @user.id)

        if historytoken.present?
          historytoken.update(token: token)

SELECT "history_tokens".* FROM "history_tokens" WHERE "history_tokens"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]
SELECT "identies".* FROM "identies" WHERE "identies"."id" = ? LIMIT ?  [["id", 85], ["LIMIT", 1]]
---
    def cek_token
      historytoken = HistoryToken.find_by(token: params[:by_token])
      user = Identy.find_by(id: historytoken.user)