app/controllers/ws_controller.rb

    def logged_in_user
        if decoded_token
            identy_id = decoded_token[0]['identy_id']
            @user = Identy.find_by(id: identy_id)
---
SELECT "identies".* FROM "identies" WHERE "identies"."id" = ? LIMIT ?  [["id", 75], ["LIMIT", 1]]