app/controllers/resources/tools.rb

SELECT "identies".* FROM "identies" WHERE "identies"."id" = ? LIMIT ?  [["id", 60], ["LIMIT", 1]]
SELECT "periode_treatments".* FROM "periode_treatments" WHERE "periode_treatments"."id" = ? LIMIT ?  [["id", 1018], ["LIMIT", 1]]
SELECT "pre_tests".* FROM "pre_tests" WHERE "pre_tests"."periode_treatment_id" = ? LIMIT ?  [["periode_treatment_id", 1018], ["LIMIT", 1]]
SELECT "references".* FROM "references" WHERE "references"."jenis" = ? AND "references"."id" = ? LIMIT ?  [["jenis", 1], ["id", 1], ["LIMIT", 1]]
---
    def self.create_treatment_by(periode_treatment_id)

        periode_treatment = PeriodeTreatment.find_by(id: periode_treatment_id)
        pre_test = PreTest.find_by(periode_treatment_id: periode_treatment.id)
        identy = Identy.find_by(id: periode_treatment.identitas_id)
        hobi = Reference.find_by(jenis: 1, id: identy.hobi).deskripsi

SELECT "references".* FROM "references" WHERE "references"."jenis" = ? AND "references"."ref_code" = ?  [["jenis", 6], ["ref_code", "51"]]
INSERT INTO "treatments" ("treat", "check", "periode_treatment_id", "created_at", "updated_at", "tanggal") VALUES (?, ?, ?, ?, ?, ?)  [["treat", 68], ["check", nil], ["periode_treatment_id", 1018], ["created_at", "2022-10-06 11:33:24.966009"], ["updated_at", "2022-10-06 11:33:24.966009"], ["tanggal", "2022-10-06"]]
UPDATE "treatments" SET "treat" = ?, "updated_at" = ?, "tanggal" = ? WHERE "treatments"."id" = ?  [["treat", 68], ["updated_at", "2022-10-06 11:33:25.627486"], ["tanggal", "2022-10-07"], ["id", 1263]]
---
                create_hobi_treatment(data)

                # LEVEL TRAUMA
                Reference.where(jenis: 6, ref_code: 51).each do |referensi|
                    treatment.treat = referensi.id
                    treatment.save

SELECT "references".* FROM "references" WHERE "references"."jenis" = ? AND "references"."ref_code" = ?  [["jenis", 8], ["ref_code", "1"]]
INSERT INTO "treatments" ("treat", "check", "periode_treatment_id", "created_at", "updated_at", "tanggal") VALUES (?, ?, ?, ?, ?, ?)  [["treat", 103], ["check", nil], ["periode_treatment_id", 1018], ["created_at", "2022-10-06 11:33:24.381795"], ["updated_at", "2022-10-06 11:33:24.381795"], ["tanggal", "2022-10-06"]]
---
    def self.create_hobi_treatment(data)

         Reference.where(jenis: data[2], ref_code: data[3]).each do |referensi|
            Treatment.create(
                tanggal: data[0],
                periode_treatment_id: data[1],
                treat: referensi.id
            )